## 1Ô∏è‚É£ Melt():    = [UnPivot]
### pandas.melt() is used to transform a wide DataFrame into a long/tidy format.
### üìå Parameters
* id_vars ‚Üí columns to keep fixed (identifier columns).
* value_vars ‚Üí columns to unpivot (melt).
* var_name ‚Üí name for the new column that will hold the previous column names.
* value_name ‚Üí name for the new column that will hold the values.

### üìå Use case:
* Converting data for plotting (Seaborn, Matplotlib).
* Preparing data for machine learning (tidy data principle).

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob"],
    "Math": [85, 90],
    "Science": [92, 88]
})

df

    Name  Math  Science
0  Alice    85       92
1    Bob    90       88

In [7]:
pd.melt(df, id_vars=['Name'], value_vars=['Math', 'Science'], var_name='Subject', value_name='Score')

    Name  Subject  Score
0  Alice     Math     85
1    Bob     Math     90
2  Alice  Science     92
3    Bob  Science     88

#### Example2:

In [8]:
df2 = pd.DataFrame({
    "Student": ["Ali", "Sara", "Youssef"],
    "Math": [90, 85, 78],
    "Physics": [88, 92, 80],
    "Chemistry": [95, 89, 84]
})
df2

   Student  Math  Physics  Chemistry
0      Ali    90       88         95
1     Sara    85       92         89
2  Youssef    78       80         84

In [9]:
df2 = pd.melt(df2, id_vars=['Student'], value_vars=['Math', 'Physics', 'Chemistry'], var_name='Subject', value_name='Score')

## 2Ô∏è‚É£ Pivot() / Pivot_table():
#### pivot() reshapes your data from long format ‚Üí wide format, the opposite of melt().
DataFrame.pivot(index=None, columns=None, values=None)
* index ‚Üí column(s) to use as row labels.
* columns ‚Üí column to use to make new columns.
* values ‚Üí column(s) to fill the values of the table.

In [10]:
df2

   Student    Subject  Score
0      Ali       Math     90
1     Sara       Math     85
2  Youssef       Math     78
3      Ali    Physics     88
4     Sara    Physics     92
5  Youssef    Physics     80
6      Ali  Chemistry     95
7     Sara  Chemistry     89
8  Youssef  Chemistry     84

In [11]:
df2.pivot(index="Student", columns="Subject", values="Score")

Subject  Chemistry  Math  Physics
Student
Ali             95    90       88
Sara            89    85       92
Youssef         84    78       80

## ‚ö†Ô∏è Important
* If there are duplicate values for the same (index, column), pivot() will raise an error.
* In that case, use pivot_table() with an aggregation function (like mean).

## üîπ What is pivot_table()?
* It‚Äôs like pivot(), but more powerful because it allows aggregation when you have duplicate values.
* pivot() ‚ùå fails if (index, column) pair is not unique.
* pivot_table() ‚úÖ handles duplicates by applying an aggregation function (default = mean).

In [12]:
# üëâ Notice Ali has two Math scores (90, 85) ‚Üí pivot() would raise an error.
df3 = pd.DataFrame({
    "Student": ["Ali", "Ali", "Sara", "Sara", "Youssef", "Youssef", "Ali"],
    "Subject": ["Math", "Math", "Math", "Physics", "Math", "Physics", "Physics"],
    "Score": [90, 85, 85, 92, 78, 80, 88]
})
df3

   Student  Subject  Score
0      Ali     Math     90
1      Ali     Math     85
2     Sara     Math     85
3     Sara  Physics     92
4  Youssef     Math     78
5  Youssef  Physics     80
6      Ali  Physics     88

In [13]:
df3.pivot_table(index='Student', columns='Subject', values='Score', aggfunc='max')

Subject  Math  Physics
Student
Ali        90       88
Sara       85       92
Youssef    78       80